const ROLES_DATA = {
    "镇民": {
        "钟表匠": {
            "emoji": "⏰",
            "引言": "不要打扰我。时钟的滴答声必须延续下去，它的每一圈循环都象征着生命，它的每一圈循环都包含着世间万物--世间的所有答案一-它是一个无比神圣的机器。好了，我必须工作了。",
            "能力": "在你的首个夜晚，你会得知恶魔与爪牙之间最近的距离。(邻座的玩家距离为1)",
            "范例": [
                "方古坐在麻脸巫婆旁边。钟表匠得知了\"1\"。",
                "诺-达鲺顺时针方向依次坐着筑梦师、舞蛇人，然后是镜像双子。诺-达鲺逆时针方依次坐着畸形秀演员、心上人、哲学家、贤者，然后是女巫。因为女巫与恶魔的距离为五，而镜像双子与恶魔的距离为三，所以钟表匠得知了\"3\"。",
                "方古与两名旅行者相邻，一善一恶。洗脑师与其中一名旅行者相邻。在第一个晚上，钟表匠得知了\"2\"，因为邪恶的旅行者不是爪牙。"
            ],
            "运作方式": "在第一个夜晚，唤醒钟表匠。对他用手势比划数字来表示恶魔与爪牙之间最近的距离(1，2，3等)。让钟表匠重新入睡。",
            "提示与技巧": [
                "你不必立即提供你的信息;等待一两天以便你可以在邪恶阵营放松警惕的时候观察其他玩家来发现可疑之处。",
                "如果你能找出一个爪牙那么你的信息将会变得非常有用。弄清楚谁是爪牙，你就可以确定谁更有嫌疑是恶魔。你需要和其他善良角色合作尝试揭露真相。许多玩家有着辨识出邪恶阵营的能力(如神谕者和女裁缝)或是辨识恶魔与爪牙的能力(如卖花女孩、城镇公告员甚至是舞蛇人)。",
                "如果你得到一个特别大的数字(>3)，那么爪牙们很可能坐的很近并离恶魔很远。同样的如果你得到一个很小的数字(<2)，那么其中一个爪牙里恶魔的距离很近。你可以利用这些信息来观察他们是否有对话，或有其他玩家的互动与你的信息匹配。",
                "如果你有怀疑是恶魔的对象，你可以利用你的信息来寻找可能是爪牙的玩家，然后观察他们，他们提供的信息以及有什么信息是关于他们的。相比于恶魔(知道三个不在场角色)爪牙们倾向于努力的隐藏自己，你可以好好利用爪牙们的弱点来确认谁是恶魔。",
                "你的信息将随着游戏推进以及玩家逐渐死亡变得越发的有用。由于邪恶的玩家不太可能会在夜晚时死去，他们往往想要活的更长来互相支持对方以及他们的观点，因此他们相比于游戏开始时会变得越来越容易暴露。观察仍然活着的玩家中是否能匹配你的信息;如果他们在暗中支持对方，那么他们很有可能是潜藏的邪恶玩家。",
                "所有你即将面对的爪牙都有明显的表现，也就是说即使他们死了，也会有明显的现象。如果你注意到突然间没有人再因为女巫诅咒而死，被洗脑师洗脑，或者因为麻脸巫婆改变角色，那么很有可能你们已经处决了这些爪牙。弄清楚这些可以让你回推出谁会是恶魔!镜像双子是一个例外，因为你通常会在很早的时候就得知他们在场。这也意味着你可能在很早就确定(最多)四个有可能是恶魔的玩家。"
            ]
        },
        "筑梦师": {
            "emoji": "💭",
            "引言": "我记得有钟表匠......天空是红色的，有不规则的三角形不断从天上坠落下来。有紫罗兰的气味......还有气泡咕嘟咕嘟的声音。个眼睛发光、还有着乱糟糟的胡须的女人对着天空发出嘶嘶声。然后，我醒了......",
            "能力": "每个夜晚，你要选择除你及旅行者以外的一名玩家:你会得知一个善良角色和一个邪恶角色，该玩家是其中一个角色。",
            "范例": [
                "筑梦师选择一名玩家，该玩家是畸形秀演员。筑梦师得知该玩家是畸形秀演员或洗脑师。",
                "筑梦师选择了一名获得了卖花女孩能力的哲学家。筑梦师得知该玩家要么是哲学家，要么是亡骨魔。",
                "在白天，镜像双子和艺术家都声称自己是艺术家。在那天晚上，筑梦师选择了镜像双子。如果说书人想帮助善良阵营，他可以给筑梦师展示这两个角色:镜像双子和心上人。反之，他可以给筑梦师展示镜像双子和艺术家这两个角色。",
                "筑梦师选择了一名玩家，他的真实角色是涡流。因为涡流的能力效果，筑梦师获得的信息必须是错误的。所以筑梦师得到这个玩家的角色是神谕者或诺-达虱"
            ],
            "运作方式": "每个夜晚，唤醒筑梦师。让他指向除自己和旅行者外的任意一名玩家。如果被选择的玩家的真实角色是镇民或外来者，向筑梦师展示他的真实角色和任意一个爪牙或恶魔角色标记。如果被选择的玩家的真实角色是爪牙或恶魔，则给筑梦师展示他的真实角色和任意一个镇民或外来者角色标记。让筑梦师重新入睡。\n如果筑梦师选择了一名邪恶玩家，你能通过这种方式来帮助邪恶阵营:你可以给筑梦师展示邪恶玩家正在伪装的虚假角色，或者展示些需要隐藏自己的角色，例如舞蛇人、贤者、畸形秀演员或呆A。",
            "提示与技巧": [
                "每次你选择一名玩家，你就会得知他潜在的一种邪恶角色的可能性。请关注这些信息，因为这会给你带来惊人的信息量，哪怕这是错误的信息。例如，任何潜在角色是爪牙的玩家将不太可能是恶魔，所以你可以将他们从你嫌疑名单上划掉。",
                "你的信息可以绝佳的辨识出是否受到涡流或诺-达鲺影响，因为和其他玩家不同，你的信息可以非常容易证实是否正确。如果你得知的一名玩家的信息不太合理，那么你就要保持怀疑了。如果你得到更多玩家的信息都不合理?那么你就要寻找其他的可能性。",
                "试着去选择没有和你邻座的玩家。如果你和诺-达鲺邻座，你就会中毒，那么你的信息就会对于恶魔有利。通过选择离你更远的玩家，你会选中邪恶玩家获得关于他们的不可靠信息的可能性就会小的多。(当然你仍然可以在后续去选择你的邻座玩家)",
                "在游戏早期提供你的信息将更有帮助。很少有玩家会直接公布他的角色，因为邪恶玩家们需要时间来配合，那么你就有绝佳的时机来证实你是一个善良玩家。",
                "当与你选择的玩家交换信息的时候，谨慎于先透露你的信息。如果你对一名邪恶玩家这么做，那么很可能你会给他提供一个可能伪装的角色。取而代之的是，让他透露他的角色给你，来看是否与你的信息匹配。",
                "如果你选择在交换信息时先透露你的信息，那么这将很明确的证实你的筑梦师角色......提供你的消息当然也是不错的选择。这将使对方对你有更多的信任，因为除此之外很难获取这样的信息。",
                "鼓励玩家们不要过早的揭示自己的角色。如果有人声明了他的角色，你仍然可以去做检查，但是如果所有人都公开了他们的角色，那你就很难去证明自己了。",
                "相比于你认为说了真话的玩家，可以去检查那些你认为在说谎的玩家。将玩家从谎言中抓出的体验是很棒的，因为你会得知这个邪恶玩家的角色，如果你想让他死去，你可以立即公布这个信息。",
                "可以选择你认为说真话的玩家;不仅这让他更受到支持，而且如果你发现你的信息错误，你可以去怀疑是否有什么其他原因导致了这一切。",
                "你永远不会得到涡流这个角色，因为如果涡流在场你必定获得错误信息。",
                "如果场上有一对镜像双子角色，不用去检查他们。你很可能会得到镜像双子中善良与邪恶的角色......这将毫无用处。有一个例外:你可以借此发现是否有涡流在场。"
            ]
        },
        "舞蛇人": {
            "emoji": "🐍",
            "引言": "这位老爷.....虽然我的烟斗是金色的，虽然我只要一首曲子就能驯服最狂野的灯神，但我只是一个卑贱的舞蛇人罢了，哎......听天由命吧。俗话说，人心不足蛇吞象。但不是我，这位老爷.....真的不是我。",
            "能力": "每个夜晚，你要选择一名存活的玩家:如果你选中了恶魔，你和他交换角色和阵营，然后他中毒。",
            "范例": [
                "舞蛇人选择的玩家是麻脸巫婆，无事发生。下个夜晚，舞蛇人选择他自己，依旧无事发生。",
                "舞蛇人选择的玩家是亡骨魔。舞蛇人立即变成邪恶的亡骨魔，曾经是亡骨魔的玩家变成善良的舞蛇人并中毒。",
                "麻脸巫婆把自己变成了舞蛇人。然后，舞蛇人一-原本为麻脸巫婆一-选择了方古玩家。舞蛇人变成了方古，方古变成了中毒的舞蛇人。但两者仍然邪恶。"
            ],
            "运作方式": "每个夜晚，唤醒舞蛇人。让他指向任意一名存活玩家。\n如果被选择的玩家不是恶魔，则无事发生。让舞蛇人重新入睡。\n如果被选择的玩家是恶魔，I旧的舞蛇人变为新的(邪恶)恶魔，并且I旧的恶魔变为新的(善良)舞蛇人。在魔典中交换舞蛇人和恶魔的角色标记。在新的舞蛇人角色标记旁放置\"中毒\"提示标记。唤醒新的恶魔并依次向他展示\"你是\"信息标记、向下的大拇指、\"你是\"信息标记、然后是恶魔的角色标记。(这代表该玩家现在是邪恶的恶魔。)让新恶魔重新入睡。唤醒新的舞蛇人并依次向他展示\"你是\"信息标记、向上的大拇指、\"你是\"信息标记、然后是舞蛇人的角色标记。(这代表该玩家现在是善良的舞蛇人。)让新舞蛇人重新入睡。\n在舞蛇人属于邪恶阵营，或者恶魔属于善良阵营的特殊情况下，依旧相应地交换他们的阵营。",
            "提示与技巧": [
                "舞蛇人存在双重可能性。在任何可能的时候，你可能变为邪恶转而开始背叛你的队伍。而在此之前，你是一名善良玩家，你的信息也极其有用(知道谁不是恶魔与知道谁是恶魔同样重要!)。不像其他玩家，你并不为了你的队伍，而是为了你自己，或者说为游戏结束时你所在的阵营。",
                "谨慎一点;只选择少数玩家来确认不是恶魔。瞄准那些你认为会存活一段时间的玩家-如果在最后一天还活着的玩家中有你知道不是恶魔的，那么你们将从3选一变为2选1!一旦你对自己收集到的信息感到满足了(或者你并不想再冒险了)，请记住你可以在晚上选择自己来避免成为恶魔!",
                "大胆一点;选择尽可能多的玩家，你确认不是恶魔的玩家越多你就越强大!这种方法会提高你成为恶魔的概率，但如果你整局游戏都是善良阵营，那么你将拥有强大的力量来对抗邪恶阵营。然而如果你变邪恶了......我相信如果你这么做的话你也不会担心遇到这样的情况不是吗?",
                "不要告诉任何人你是舞蛇人，除非你确信你自己不会变为邪恶阵营。被你偷走恶魔角色的玩家现在是善良阵营，他会提供大量所发生的信息，如果此时有任何人知道你是舞蛇人，你会面临巨大的麻烦。尝试不揭露自己的角色直到死亡，或者你决定不再选择新的玩家。",
                "请牢记每个你选择的玩家如果没有使你交换角色，那么他不是恶魔。在验证恶魔时，你比占卜师更加精确......只要你能够让团队相信你。",
                "如果你一直是善良阵营，在最后请说出你的信息一-如果你一直隐藏你的信息那只会对善良阵营造成伤害!如果你变邪恶了......不要承认自己是舞蛇人，而是先抓紧找个角色伪装吧。",
                "突然变为恶魔会让人很震惊，所以你要为这个可能性做好准备。准备一个角色，即便最坏的情况发生了，你也可以马上声明自己是恶魔但被舞蛇人给交换了。只要你足够快且气势汹汹，那么可怜的恶魔将很难跟上你的步调来证明你才是邪恶的那一个。",
                "那么如果你是恶魔但是变成了舞蛇人该怎么办?不必烦恼--你现在属于善良阵营，依然有着足够清晰的方式获得胜利。你有几个选择--立即告知大家你现在属于新的阵营，暴露你的爪牙，然后用你邪恶的能力来追捕新的恶魔吧......或者你也可以什么都不说直到几天后。如果这样，你的爪牙们仍然会相信你是恶魔然后去运用他们的能力寻找和对抗新的恶魔。同时在这期间你也可以悄悄的告诉一两个善良阵营的玩家让其成为你秘密找寻恶魔计划的伙伴。"
            ]
        },
        "数学家": {
            "emoji": "🔢",
            "引言": "任何连续的，且能进行定量初等运算的形式系统X，都具有不完全性。也就是说，在这个形式系统X内存在一些命题，这些命题既不能被证明为真，也不能被证明为否。所以，你喝醉了。",
            "能力": "每个夜晚，你会得知有多少名玩家的能力因为其他角色的能力而未正常生效。(从上个黎明到你被唤醒时)",
            "范例": [
                "中毒的神谕者得知有两名死亡玩家是邪恶的，但是事实上有三名死亡玩家是邪恶的。所有其他能力正常生效。数学家得知了\"1\"，因为舞蛇人和杂耍艺人的能力没有出现异常，但博学者得知的其中一条信息原本应该是错误的。",
                "涡流在游戏中。五名善良玩家得知了错误信息。女巫醉酒了，当被女巫诅咒的玩家发起提名时，该玩家没有死亡。虽然有六名玩家的角色能力都没有正常生效，但是数学家由于涡流的能力，得知了\"3\"。"
            ],
            "运作方式": "每当一名玩家的角色能力由于其他角色的能力而未正常生效时，在该玩家的角色标记旁放置\"未正常生效\"提示标记。\n每个夜晚，唤醒数学家。对他用手势比划数字(0，1，2等)这个数字等同于魔典中\"未正常生效\"提示标记的数量。让数学家重新入睡。移除所有\"未正常生效\"提示标记。",
            "提示与技巧": [
                "你的信息是很有用的，但前提是你得弄清楚其他人都做了什么。和你的队友们沟通，得到他们的信息，尽可能找到谁的信息不正确或能力没有正常生效--这将对善良阵营有着巨大的帮助。一些类似于钟表匠、卖花女孩、女裁缝和神谕者等等的角色会需要你的帮助来确保他们的信息是正确的。",
                "注意你的信息可能会受到游戏进程改变，如果你得到的信息突然变化，请保持警惕。如果刚刚心上人被处决了，那么你得到的数值很可能在夜晚增加。又或者，如果你之前得到的信息是\"0\"然后突然变成了\"2\"，那么你可以怀疑是麻脸巫婆创造出了一名诺-达。",
                "务必和说书人确认你的能力所观测的是什么异常情况。在梦殒春宵中，你通常会观测善良玩家的能力因为邪恶角色导致的改变，例如诺-达鲺和涡流。然而，你也同样会观测这些情况，如心上人死后，哲学家选择了在场的一个角色，或者中毒的舞蛇人选择了一个恶魔但无事发生。",
                "当心涡流!和其他人一样，所有你的信息将会是错误的。如果你得到一个很小的数字，但是看起来有很多人的信息都错误了，那么你可以怀疑有涡流在场。特别是当其他人似乎得到错误信息的时候而你得到的信息是\"0\"那么你可以认为你中毒了或者涡流在场。",
                "得到\"0\"的信息是非常棒的，因为这意味着没有人会获得错误信息或者会发生能力异常。每个人都可以相信他们在白天和夜晚所获得的信息。",
                "得到\"1\"的信息也是很不错，这意味着只有一个能力没有达到预期结果。如果你们可以找出是那一个是什么，那么其他人就可以相信他们在那天的能力是有效的。",
                "如果你得到的信息是\"2\"或者更大，那么你们可能将面临麻烦。这说明了你们之中有很多能力出现了异常......或者你中毒了。",
                "与其他镇民不同，数学家可以不必害怕站出来说明自己的角色:色。不仅仅因为你的信息要分享出来才最有用，而且即便你只能提供一晚上的信息也是相当有价值的，何况你对邪恶阵营的威胁相比卖花女孩与杂耍艺人等角色要小的多。"
            ]
        },
        "卖花女孩": {
            "emoji": "🌹",
            "引言": "昨天，我的紫罗兰凋谢了。今天，我的罂粟花盛开了。",
            "能力": "每个夜晚*，你会得知在今天白天时是否有恶魔投过票。",
            "范例": [
                "今天白天有一项提名。很多玩家投票，被提名的玩家被处决。但恶魔没有参与投票。那天晚上，卖花女孩得知了\"否\"。",
                "今天白天共有三项提名。恶魔在第二次提名投票，没有人被处决。那天晚上，卖花女孩得知了\"是\"。",
                "今天白天没有提名。白天有一名旅行者被流放了，流放时所有玩家都举手表示赞成。那天晚上，卖花女孩得知的信息是\"否\"，因为赞成流放不是投票。"
            ],
            "运作方式": "每个黎明，在卖花女孩角色标记旁放置\"恶魔未投票\"提示标记，并移除\"恶魔已投票\"提示标记(如果有)。\n每个白天，如果恶魔在任何处决中投票，则将\"恶魔未投票\"提示标记替换为\"恶魔已投票\"提示标记。\n除首个夜晚以外的每个夜晚，唤醒卖花女孩。如果卖花女孩被标记为\"恶魔未投票\"，摇头告知否。如果卖花女孩被标记为\"恶魔已投票\"，点头告知是。让卖花女孩重新入睡。\n如果你忘记了恶魔是否在白天投票，在夜晚唤醒恶魔，并向他展示\"你今天投票了吗?\"信息标记。他必须诚实回答，然后重新入睡。",
            "提示与技巧": [
                "注意!你需要掌握每天都有谁参与投票了，否则你的信息就不会有太大用处。邪恶的玩家可能会在他们是否投票上撒谎，所以如果你忘记了，不要过分依赖于让别人来告诉你都有谁投票了。你的信息可以帮助锁定恶魔的位置，所以请确保这个信息是有效的。",
                "相比于经常投票的人，对那些不投票的人留个心眼。邪恶阵营玩家可能不太希望投票来引起你的注意，但是如果你成功的让大量玩家参与了投票而得到信息为\"否\"，那么你就可以锁定恶魔是在那些没有投票的玩家之中。同时对于那些在很多人投票时参与投票的人留心，因为很有可能有一个恶魔试图伪装自己而加入投票，从而来限制你的信息。",
                "对于一次处决而言，只需要存活玩家的一半的票数就可以成功。如果将要决定处决，试图去说服大家限制他们的投票来达到需求范围。这可以使你清晰的将玩家们分为两组一-如果你的信息是\"是\"，那么你就知道恶魔参与了白天的投票。如果是\"否\"，那么你就知道恶魔在那些白天没有投票的人之中。通过这种方式来控制投票可以更容易缩小恶魔的范围，但很显然，和保持沉默来观察投票相比，这会使你更容易成为恶魔的击杀目标。",
                "你的能力可以让你侦查到恶魔，所以你会成为邪恶阵营比较优去解决的目标。试着和其他你认为是善良的玩家配合，让他们来保护你。尤其是像贤者这样的(希望恶魔以他们为目标)角色会希望来伪装成你的角色，吸引恶魔的仇恨，而你就可以在暗处收集有关恶魔的信息。这样可以保护你不会成为女巫，洗脑师和麻脸巫婆等会干扰你的角色的目标。",
                "你和城镇公告员有着特别的协同作用，因为你们都是对于提名及处决投注精力的玩家。当你在追踪谁投票时，同时也特别关注是谁发起的提名。这不仅可以帮助你的队友，而且你在做投票控制的同时，给他们的这点帮助并不会让你付出什么代价。",
                "在罕见的情况下，你可以直接侦查到涡流是否在场。如果所有玩家投票了，但是你得知没有恶魔参与投票，那么涡流必然在场(这将是一个非常有用的信息)，或者你中毒/醉酒了(这对大家而言也是非常有用的信息)"
            ]
        },
        "城镇公告员": {
            "emoji": "📢",
            "引言": "号外!号外!迷宫中的巫术!天才博学者揭露了一切谜团!城镇有危险了!号外!",
            "能力": "每个夜晚*，你会得知在今天白天时是否有爪牙发起过提名。",
            "范例": [
                "今天白天，仅有一名镇民玩家发起提名。当晚，城镇公告员得知了\"否\"。",
                "今天白天，有四名玩家发起提名。其中两名玩家是爪牙。有很多玩家投票，但无人被处决，当晚，城镇公告员得知了\"是\"。",
                "名爪牙流放了一名旅行者。当晚，城镇公告员得知了\"否\"，因为发起流放不是提名。"
            ],
            "运作方式": "每个黎明，在城镇公告员角色标记旁放置\"爪牙未提名\"提示标记，并移除\"爪牙已提名\"提示标记(如果有)。\n每个白天，如果有任何爪牙发起提名，则将\"爪牙未提名\"提示标记替换为\"爪牙已提名\"提示标记。\n除了第一个夜晚的每个夜晚都唤醒城镇公告员。如果城镇公告员被标记为\"爪牙未提名\"，摇头告知否。如果城镇公告员被标记为\"爪牙已提名\"，点头告知是。让城镇公告员重新入睡。然后移除\"爪牙已提名\"标记，如果有的话。\n如果你忘记了爪牙是否在白天提名，在夜晚分别单独唤醒每名爪牙玩家。每次唤醒一名玩家并对他展示\"你今天提名了吗?\"信息标记。他必须诚实回答，然后重新入睡。随后再唤醒下一名爪牙玩家。",
            "提示与技巧": [
                "注意每天都有谁发起了提名!这应该很容易理解，因为你在每晚得到的信息只有在知道有谁提名时才能有用。邪恶玩家可能会对你撒谎，而且每天会发生大量的事情，即便是善良玩家也可能会在几天后忘记提名的情况。",
                "尽可能多的让不同的人去提名，提名的人越多你就越能发挥自己的能力去推动游戏的进程。",
                "与占卜师不同，当你得到信息\"否\"时并不能给你太多有用信息。因为有可能实际上恶魔潜藏在其中。相反，如果你得到\"是\"则会很有价值一-这会让你发现爪牙，你可以尽可能让他们被处决。",
                "要当心女巫!因为她们和你一样也希望更多的人发起提名，因为这会提高他的诅咒生效的机会。试着去推测女巫会对谁使用能力(例如那些很积极的玩家或者经常提名的玩家)并鼓励其他人去提名。",
                "如果镜像双子在场，你可以让他们其中的一个进行提名，这可以帮助你了解谁是真正的爪牙!你只需要结合其他镇民的信息来确保你的信息正确，排除涡流或者其他会导致你能力失效的风险;毕竟如果弄错镜像双子，那么游戏就结束了!",
                "你和卖花女孩有着特别的协同作用，因为你们都是对于提名及处决投注精力的玩家。当你在关注谁提名时，同时也特别关注是谁投票了。这不仅可以毫不费力的帮助到你的队友，而且可以让他免除暴露自己给恶魔的风险。",
                "如果你在游戏早期发现了一个爪牙，那么你们最好是把他处决了。而如果你是在游戏后期发现一个爪牙。那么你们可能考虑留着他而去处决其他人。毕竟，游戏的目标是找到恶魔并处决，而不是爪牙。"
            ]
        },
        "神谕者": {
            "emoji": "🔮",
            "引言": "\"唯有受选者才能凝视面纱之外的光景。亡者躁动不安......他们的每一根僵硬的手指都指向了刺骨的北地。",
            "能力": "每个夜晚*，你会得知有多少名死亡的玩家是邪恶的。",
            "范例": [
                "第一个白天，卖花女孩被处决。当晚，恶魔杀死了杂耍艺人。神谕者被唤醒并得知\"0\"，因为所有死亡玩家都是善良的。",
                "游戏进行到一半，七名玩家死亡。其中五名是善良的，两名是邪恶的。并且在白天，一名邪恶旅行者被流放了。当晚，恶魔杀死了他的一名爪牙。神谕者醒来并得知了\"4\"，因为四名死亡玩家是邪恶的。"
            ],
            "运作方式": "除了第一个夜晚的每个夜晚，唤醒神谕者。对他用手势比划已死亡的邪恶玩家的数量(0，1，2等)。让神谕者重新入睡。",
            "提示与技巧": [
                "只要你的信息是\"0\"，你就可以相信那些已经死去的玩家都是善良的，也因此你可以与他们合作并使用他们的信息。",
                "一旦你得到\"1\"或者更大的信息时，邪恶玩家已经有人死去，你现在需要尤其注意和谁去沟通交流。将你的怀疑交给他们去做他们会急切的希望证明自己是好的，并帮助你来做很多相关指控。",
                "大部分在夜晚死亡的玩家是善良的。邪恶的玩家希望自己能尽可能的活下去，所以恶魔通常也会集中去杀戮那些有威胁的善良玩家。如果你突然得知有一个邪恶玩家，你通常需要开始怀疑最近被处决的玩家。",
                "方古和亡骨魔是两个你可以辨别出的恶魔。方古会在他击杀外来者时将其转化，而亡骨魔很可能在游戏早期杀死他的一两个爪牙同伴，以确保他的能力保持持续有效。如果你发现了这两种情况中的趋势，那么去检查来自这些恶魔的其他内容(比如:外来者数量、在只有少量玩家存活时有爪牙能力生效)。如果你可以确认是其中的一种情况，那么你就可以确认没有涡流影响，并且这将为你的胜利带来战略上的意义。",
                "你可以随意一些，想要早些说明自己角色或晚些都可以，你会一整天都得到有用的信息，所以即便你只有第一天晚上的信息对善良阵营来说也是很有用的。你可以在你的死亡的基础上推断出两种情况一-有亡骨魔受到了你的威胁，或者有某个邪恶玩家白天被处决了但恶魔不想让你知道。"
            ]
        },
        "博学者": {
            "emoji": "📚",
            "引言": "地上有七十二根火柴......今天的太阳落得更早，月亮还是按时升起......一块破布......庄园里的邪恶之物......三个又三个.......我们相信的事物和他真正看到的不一样......绿光代表镁......残留物，但是图案不太对......地上有七十二根火柴...",
            "能力": "每个白天，你可以私下询问说书人以得知两条信息:一个是正确的，一个是错误的。",
            "范例": [
                "博学者得知\"所有戴眼镜的玩家都是善良的\"以及\"坐在黑色沙发上的玩家之一是爪牙\"。",
                "博学者得知\"舞蛇人存在于游戏中\"和\"昨晚每个玩家都得到了真实的信息\"。",
                "博学者得知\"恶魔是女性玩家\"和\"小八属于邪恶阵营\"。",
                "博学者得知\"小文和小米属于同一个阵营\"和\"只有一名外来者在场\"。"
            ],
            "运作方式": "每个白天仅限一次，如果博学者要求与你进行私聊，请和他一起离开玩家围成的圆圈，保证你们的私聊不会被偷听。然后以耳语的方式告知博学者一真一假两条信息。(如果你无法立刻想出两条信息，要么多想一会儿，要么让博学者几分钟后再来找你。)\n保证你提供的信息有用并且与游戏有关。避免提供恶魔是谁这种信息，否则可能导致游戏快速结束。如果你无法决定告知博学者什么信息，你可以选择提供类似于镇民能力能够获取的信息。",
            "提示与技巧": [
                "在每天你可以得到一条真信息和一条假信息。最简单的运用方式就是选择一条你认为是真信息的然后去推理。例如，说书人告诉你a)有畸形秀演员在场b)你的邻座都是善良的，而现在没有证据表明畸形秀演员在场，那么你只需要假设你的邻座确实都是善良的。有可能这是错误的，但是你必须要做出一个\"最好的假设\"。",
                "在某些情况下，你的其中一条信息会被证实是正确的，那么另一条就是错误的。或者其中一条被证实是错误，则另一条就会是正确的。这将为你让你得知大量信息。例如，如果你得知a)有一个金发玩家是爪牙b)有三个外来者在场，如果大量证据表明爪牙已经死去了(而死去的玩家中没有金发玩家)，那么你可以大胆认为场上确实有三个外来者。",
                "有些时候你可以尝试去验证你其中一条的真假，这同样会给你带来很多信息。例如，如果你得知a)恶魔穿着衬衫或b)坐在黑色沙发上的玩家都是善良的。那么你可以故意去处决所有穿着衬衫的玩家，而如果游戏仍然继续，恶魔仍然在夜里行动，那么你就知道恶魔没有穿衬衫，所以所有坐在黑色沙发上的玩家就都是善良的。",
                "如果你能判断你哪条信息是错的，那么假信息就和真信息一样有用。当你在颠倒真假信息时，注意不要犯逻辑错误。例如，你得知\"女巫昨晚选择了一名善良玩家\"，如果你认为这条信息是错的那么相反的信息并不一定是\"女巫昨晚选择了一名邪恶玩家\"，因为也许并没有女巫在场，又或者女巫已经死了。你唯一能够知道的是所有善良玩家昨晚都没有被女巫诅咒所以可以放心提名。",
                "每一天你可以得到两条信息。要立刻分辨出哪一条是真信息可能不太容易，但随着游戏进行，你可以将后续的信息与之前的信息对比，从而得出具体的结论。例如，如果你在第一天得知a)有舞蛇人在场或b)所有戴帽子的玩家是善良的。然后在第三天，你得知a)有一个新的玩家在昨晚成为了恶魔b)爪牙已经死了，那么这些信息就有所交互。如果你假设恶魔已经被舞蛇人换了，那么你就可以推断至少有一个戴帽子的玩家是邪恶的，并且爪牙仍然还活着。",
                "告诉大家你在每天得到的信息，可以让大家帮助你记住。一旦游戏不断推进，你可能很难记住说书人说的所有信息。毕竟，你需要成为一名真正的博学者!告诉大家你的信息以确保这些信息不会被遗忘。或者，如果你有很好的记忆力(或者你能悄悄的写下来，又或者说书人允许你写下来做记录)，那么你可以保持低调，然后在后续一次性揭露你的爆炸信息。",
                "为了获得更多信息，你需要尽可能的多活几天。你可以装作是那些恶魔不太愿意去攻击的对象，如:贤者、钟表匠或者已经使用能力的女裁缝等，或者你也可以保持沉默。你活的越久，你能得到的信息就越多。但是也不要藏的太久......你需要适当的早些告诉大家你的信息，来帮助大家处决邪恶玩家，否则由于女巫，洗脑师或者畸形秀演员等能力，你们之中会有越来越多的人死去。如果有镜像双子或者涡流在场，那么利用你的信息对大家进行纠正将会尤其的有用。",
                "注意说书人使用的词汇--如果你做了小小的变更有可能会出现截然不同的结果。由于对说书人而言如果博学者在游戏中将会非常困难，因为他们需要编造一些对你有用但又不能对邪恶阵营太过不公平的信息，所以说书人通常会非常谨慎的给出信息。要准确的记住说书人给出的信息，以免产生混淆。例如，如果说书人说\"所有爪牙都坐在蓝色沙发上\"而你告诉大家\"蓝色沙发上的玩家都是爪牙\"，那么你就犯了一个逻辑错误。又或者，如果说书人说\"恶魔戴着眼镜\"，而你告诉大家\"恶魔就是戴眼镜的人\"，请注意，这里的说法略微不同一如果恶魔在你不注意的情况下摘下眼镜，而你一直告诉大家恶魔戴着眼镜，你就错了。",
                "每一天都要去找说书人，以尽可能的获取更多的信息。随着你每天都去找说书人，你就会得到更多的信息，当然恶魔也更有可能去杀你。博学者对于恶魔而言是一个非常危险的角色，所以如果恶魔看见你在每天都去找说书人，那么即使你没有说明你自己的角色，恶魔也可能会在晚上攻击你。",
                "你也可以在前期不去找说书人。这样会导致你获取更少的信息，大但同时更容易存活。而你在当时获取的信息有可能会更有价值。在通常情况下，如果只有3、4、5名玩家存活时，你的信息会更有用，因为它会指向更少的玩家。例如，在12人存活时，得知两名玩家中有一个是爪牙是比较简单的，但是如果只有3个玩家存活，那就会变得非常简单。"
            ]
        },
        "女裁缝": {
            "emoji": "🧵",
            "引言": "你听到那个穿羊绒大衣的家伙对我们小贝尔说什么了吗?他说......好?哎，行吧，和哈利还有那个杂耍艺人那一出相比，这算不了什么。说什么?我可不说，我又不是什么长舌妇。",
            "能力": "每局游戏限一次，在夜晚时，你可以选择除你以外的两名玩家:你会得知他们是否为同一阵营。",
            "范例": [
                "在第一个夜晚，女裁缝选择了两名玩家，他们是理发师和钟表匠。因为他俩都是善良的，女裁缝得知\"是\"。",
                "在前三个夜晚，女裁缝选择不使用他的能力。在第四个夜晚，她选择了两名玩家，他们分别是方古和心上人，女裁缝得知\"否\"",
                "麻脸巫婆把数学家变成了女巫，女巫仍然是善良的。当晚，女裁缝选择了两名玩家，他们是女巫和城镇公告员。女裁缝得知\"是\"，因为他们是善良的。"
            ],
            "运作方式": "每个夜晚，唤醒女裁缝。她要么摇头不使用能力，要么指向另两名玩家。\n如果她摇头，无事发生。让女裁缝重新入睡。\n如果她指向两名玩家，要么点头代表是(表示这些玩家是同一阵营)，要么摇头代表否(表示这些玩家不是同一阵营)。让女裁缝重新入睡。在女裁缝使用能力后，为她放置\"失去能力\"提示标记，并从夜晚顺序表上移除她的夜晚标记。",
            "提示与技巧": [
                "你可以过几天再使用你的能力。虽然这有一定的风险，你很可能在这段时间内死亡，但是如果你等待一段时间，你就会对当前局势有一定的了解，比如大家都说自己是什么角色以及你觉得谁可疑。这也意味着随着处决以及恶魔击杀玩家，只有更少的活着的玩家供你选择。",
                "尽快的使用你的能力!你只有一次机会，如果你在还没使用时就死去了，你肯定会为此自责。即使在首夜随机选两个玩家也比到时候一个都选不了好。",
                "一个常见的女裁缝易犯的错误是没有记住你辨识的是是否是同一阵营-而不是是否是\"善良\"阵营。这也就意味着，如果你足够幸运直接选择了两名邪恶玩家，那你依然会得到信息\"是\"。虽然你更有可能是选到两名善良玩家，但是如果你并不确定，你可以尝试协同其他玩家的信息(如钟表匠)，来看看是否关联到你的信息。你也可以在你还没有揭露他们是同一阵营时观察这两名玩家，看看他们是否相互串通或包庇。",
                "如果你有一个很信任的玩家(不管活着还是死了)，你可以参照他来确认其他玩家的阵营。如果你得知他们属于不同阵营，那么你可以确信另一个玩家会是邪恶的那一个。这在处理棘手的镜像双子时尤其有效。",
                "把能力用在那些你不太了解的人身上!得知两名玩家是否同一阵营是非常强力的，这可以帮助大家决定是否相信他们是某一角色以及是否相信他们的所作所为。",
                "把能力用在那些对游戏有重要影响的角色身上。弄清楚博学者或者卖花女孩是否可信要比弄清楚理发师是否可信要更有效。",
                "大般情况下，不要选择那些你的邻座玩家。如果你坐在诺-达鲺旁边，他们会使你中毒并且会非常赞同你的观点。通过选择离你更远的玩家，虽然你仍然可能因为中毒得到错误信息，但是至少你可以知道他们之中没有恶魔来搅局。"
            ]
        },
        "哲学家": {
            "emoji": "🎓",
            "引言": "如果你要说什么事情是最真实的?我想是啤酒。痛快喝吧，说不定我们明天就要死了。",
            "能力": "每局游戏限一次，在夜晚时，你可以选择一个善良角色:你获得该角色的能力。如果这个角色在场，他醉酒。",
            "范例": [
                "哲学家选择获得筑梦师能力。从现在起，他将在筑梦师应该行动时进行行动。",
                "在第三个夜晚，哲学家选择获得钟表匠的能力。当晚，他得知了恶魔与爪牙之间的最近的距离。",
                "哲学家选择获得了艺术家的能力，但场上已经有一名艺术家。那名艺术家玩家醉酒。在那之后，哲学家死亡，艺术家玩家恢复清醒。(如果哲学家醉酒或者变成了新的角色，原来那个因哲学家而醉酒的玩家也会恢复清醒。)"
            ],
            "运作方式": "每个夜晚，唤醒哲学家。他要么摇头不使用能力，要么指向角色列表上一个镇民或外来者图标。让哲学家重新入睡。\n如果他指向的是不在场的角色，将哲学家角色标记更换为他所选的角色标记，并放置\"是哲学家\"提示标记。\n如果他指向的是一个已在场的角色，该角色醉酒，在角色标记旁放置\"醉酒\"提示标记。(现在，你可以把被选择角色的相关提示标记给哲学家使用了。)如果哲学家死亡，醉酒的玩家将恢复清醒，此时需要移除\"醉酒\"提示标记。\n(由于实体标记的操作方式在两种情况下不同，再加上哲学家的能力是会对对应的角色进行动态检测，因此建议说书人还应该以其他方式对此进行记录，这里提供一个参考处理方式:如果对应角色在场，互换哲学家和那个角色的标记，并在哲学家角色标记旁标记醉酒，在换来的角色标记旁标记\"是哲学家\"。这样也能应对在哲学家选择了一个不在场的角色，但随后该角色又再次在场的情况。",
            "提示与技巧": [
                "哲学家最强大之处就是他的能力非常广泛，多才多艺。你可以模仿列表中的任何善良角色!尝试去了解队伍缺少什么或者谁对于对抗当前的邪恶势力更有效。每一个镇民都是可以选择的选项:",
                "1.钟表匠-由于钟表匠只在首个夜晚获得信息，所以你可以在后续的任何时候放心的选择钟表匠的能力。这不仅可以让你确认钟表匠